content/posts/honeyhttpd.md
---
title: "Threathunting III: HTTP Honeypot develop and setup"
author: ["Dirk"]
date: 2025-08-13T06:35:00+02:00
lastmod: 2025-08-19T12:02:12+02:00
tags: ["threathunting", "honeypot"]
categories: ["forensic"]
draft: false
weight: 1003
---

<div class="ox-hugo-toc toc">

<div class="heading">Table of Contents</div>

- [Introduction](#introduction)
    - [Brief overview of the use case](#brief-overview-of-the-use-case)
- [Setting up HoneyPot HTTPD for Web Data](#setting-up-honeypot-httpd-for-web-data-ingestion)
    - [Containerizing the application to run inside docker](#containerizing-the-application-to-run-inside-docker)
    - [🚀 Code adjustments for our environment](#code-adjustments-for-our-environment)
    - [📝 Conclusion](#v-dot-conclusion)

</div>
<!--endtoc-->


## Introduction {#introduction}


### Brief overview of the use case {#brief-overview-of-the-use-case}

I recently set out to ingest web traffic data into my SIEM solution,
which requires data to be ingested in a specific format. After
researching various options, I sought an easy-to-use solution that could
integrate with our existing Elasticsearch setup. One tool that caught my
attention was HoneyPot HTTPD.

As I researched potential solutions, I realized that many of them
required manual configuration and scripting to ingest web data into
Elasticsearch. However, HoneyPot HTTPD offered a simple and elegant way
to do so through its built-in ingestion feature. This was especially
appealing since I wanted to integrate the web traffic data with our
existing SIEM setup that utilized Elasticsearch.

In particular, I needed a tool that could collect web traffic data and
forward it to a centralized location for analysis and processing.
Honeypot HTTPD's ability to ingest web data into Elasticsearch made it
an attractive choice, as it would allow me to leverage our existing
Elasticsearch infrastructure and integrate the data with our SIEM
solution seamlessly.

With this in mind, I set out to explore how to use HoneyPot HTTPD to
ingest web traffic data into Elasticsearch. In the following sections,
I'll walk you through the steps I took to configure HoneyPot HTTPD for
ingestion, including the Dockerfile used to build the container and any
additional configuration settings required.


## Setting up HoneyPot HTTPD for Web Data {#setting-up-honeypot-httpd-for-web-data-ingestion}


### Containerizing the application to run inside docker {#containerizing-the-application-to-run-inside-docker}

-   Creating a Dockerfile

    I started by creating a Dockerfile that would build the HoneHTTPD
    image. The Dockerfile included the following instructions:
    ```sh
    # Use python base image
    FROM python:3

    # Set environment
    ARG APP_NAME=honeyhttpd
    ENV APP_NAME=${APP_NAME}

    ARG USER_ID="10001"
    ARG GROUP_ID="app"
    ARG HOME="/app"

    ENV HOME=${HOME}

    # Create user and environment
    RUN groupadd --gid ${USER_ID} ${GROUP_ID} && \
        useradd --create-home --uid ${USER_ID} --gid ${GROUP_ID} --home-dir /app ${GROUP_ID}


    # Install dependencies
    RUN apt-get update && \
        apt-get install -y --no-install-recommends \
            file        \
            gcc         \
            libwww-perl curl unzip && \
        apt-get autoremove -y && \
        apt-get clean

    # Set workdir
    WORKDIR ${HOME}

    # Copy config files and certs into container
    COPY ./requirements.txt .
    COPY ./config.json .
    COPY ./server*.pem .
    COPY ./ca.crt .
    COPY honeyhttpd logs servers util .
    COPY start.py .

    # Upgrade python packages and install dependencies
    RUN pip3 install --upgrade pip
    RUN pip3 install virtualenv
    RUN python3 -m virtualenv ${HOME} && \
    virtualenv ${HOME}
    RUN pip3 install --no-cache-dir --upgrade pip setuptools wheel elasticsearch==8.13.0 && \
    pip3 install --no-cache-dir --upgrade -r ./requirements.txt && pip3 install -r ./requirements.txt

    ADD . ${HOME}

    # Remove compilers
    RUN apt-get remove gcc --purge -y

        # Drop root and change ownership of the application folder to the user
    RUN chown -R ${USER_ID}:${GROUP_ID} ${HOME}
    USER ${USER_ID}

    # Expose Honeypot ports to outside world
     EXPOSE 8443:8443

    # run cowrie with config
    CMD ["python3", "start.py", "--config", "config.json"]
    ```
    In this Dockerfile, I:

    -   Installed necessary dependencies, including Python and pip
    -   Installed the required packages, including HoneyPot HTTPD
    -   Set the working directory to /usr/local/bin to run the application
        from
    -   Exposed port 80 for HTTP traffic
    -   Copied the configuration file (config.yaml) into the container
    -   Specified the command to run HoneyPot HTTPD with the -c option,
        which points
    -   to the configuration file

-   Building and Running the Container

    Once I had created the Dockerfile, I built the image by running the
    following command:
    ```sh
    sudo docker build -t honeyhttpd .
    ```
    This command told Docker to create an image with the tag honeyhttpd
    using the instructions in the Dockerfile.To run the container, I used
    the following command:
    ```sh
    sudo docker run --hostname honeyhttpd -p 8443:8443 honeyhttpd
    ```
    This command started a new container from the honeyhttpd image and
    mapped port 8443 on the host machine to the port 8443 in the container.

-   Configuring the Container

    To configure the honeypot, I updated the config.yaml file to point to
    my Elasticsearch instance. Here's an example of what the configuration
    file might look like:
    ```json
    "loggers": {
        "ElasticSearchLogger": {
            "active": true,
            "config": {
                "server": "https://192.168.210.95:9200",
                "verify_certs": true,
                "username": "elastic",
                "password": "SecretPassword",
                "index": "cowrie.webhoneypot",
            }
        }
    ```
    the server config itself is quite simplistic:
    ```json
      "servers" : [
            {"handler": "ApachePasswordServer", "mode": "https", "port": 8443, "domain": "cooldomain.com", "timeout": 10, "cert_path": "server_cert.pem", "key_path": "server_key.pem"},
        ],
        "user": "nobody",
        "group": "nogroup"
    }
    ```
    This configuration told HoneyPot HTTPD to forward web traffic data to
    my Elasticsearch instance, where it could be processed and stored.

    For the cert_path and key_path we earlier copied the self signed cert and
    key to the container.

    With the container running and configured, I was now ready to test
    HoneyPot HTTPD's ability to ingest web traffic data into
    Elasticsearch.

    Which I did with just opening <https://honeypot.home.arpa:8443> in my
    webbrowser. Which gave me the htpasswd auth prompt.


### 🚀 Code adjustments for our environment {#code-adjustments-for-our-environment}

I started from the original ApachePasswordServer in honeyhttpd, which was
fairly minimal—it simply responded with a 401 on selected paths and captured
credentials in a rudimentary way. I overhauled it to better structure logging,
extract metadata, and sanitize inputs before sending logs to Elasticsearch.

Below, I explain each change with commentary.


#### 🔐 Improvements in ApachePasswordServer.py: {#improvements-in-apachepasswordserver-dot-py}

This update significantly extends the functionality of ApachePasswordServer.py.
It builds on the original honeyhttpd implementation by enhancing its ability to simulate
Basic Authentication, extract and decode credentials from the \`Authorization\` header,
and log structured metadata about each HTTP request and response.

It now integrates tightly with an \`ElasticSearchLogger\`, providing enriched, sanitized logs
for further analysis or visualization. Custom helper functions ensure safe parsing,
while connection and client metadata offer greater context to the captured events.

<!--list-separator-->
