content-org/adventuresthreathunting.org
***** 📊 Summary of Changes

- 2 files changed: ApachePasswordServer.py and Elasticsearchlogger.py
- Key improvements:
  - Simulation of Basic Auth (401 challenge on sensitive paths)
  - Credential extraction and decoding from `Authorization` header
  - Connection metadata collection (IP, port, useragent etc.)
  - Header parsing with case-insensitive lookup
  - Structured request and response logging
  - Integration with `ElasticSearchLogger`
  - Safer JSON serialization and error handling
Here I describe how I extended the honeypot server to improve credential
logging and integrate with Elasticsearch for structured logging.

Starting from a basic server that simply issued 401 responses,
I added features to parse HTTP requests, decode Basic Auth headers,
and enrich logs with request and connection metadata. This makes the
server far more useful for DFIR research and threat hunting.

---

**** Original baseline (for reference)

Big thanks to the great ground wrok from bocajspear1
over at github with the [[https://github.com/bocajspear1/honeyhttpd][honeyHTTPD]] Server. That way
I did not had to write all from scratch. But I still had to
make some improvements in order to use the honeypot in my Environment.
#+begin_src python
from servers.ApacheServer import ApacheServer
import honeyhttpd.lib.encode as encode

class ApachePasswordServer(ApacheServer):
    def on_request(self, handler):
        return None, None

    def on_GET(self, path, headers):
        if path == "/" or path == "/index.php" or path == "/admin":
            return 401, [],  "Basic realm=\"Secure Area\""
        return 404, [], ""

    def on_POST(self, path, headers, post_data):
        return 404, [], ""

    def on_error(self, code, headers, message):
        return code, [("Connection", "close"), ("Content-Type", "text/html; charset=iso-8859-1")], message

    def on_complete(self, client, code, req_headers, res_headers, request, response):
        extra = {}
        for header in req_headers:
            if header[0].lower() == "authorization":
                auth_split = header[1].split(" ")
                if len(auth_split) > 1:
                    auth_data = auth_split[1]
                    extra['creds'] = encode.decode_base64(auth_data)
        self.log(client, request, response, extra)

    def default_headers(self):
        return []
#+end_src


**** 🆕 Auto-Injection of ElasticSearchLogger in __init__()
To ensure consistent structured logging, `ElasticSearchLogger` is
now injected into the logger stack if not already present.

#+begin_src diff
+ if loggers is None:
+     loggers = []
+ if not any(isinstance(logger, ElasticSearchLogger) for logger in loggers):
+     loggers.append(ElasticSearchLogger())
#+end_src

This avoids missing logs if the user forgets to pass a logger during instantiation.

---

**** 🔐 New GET Handler Simulates Apache Basic Auth Challenge
The server now returns `401 Unauthorized` and prompts for credentials on common admin paths.

#+begin_src diff
+ def on_GET(self, path, headers):
+     if path in ["/", "/index.php", "/admin"]:
+         return 401, [], 'Basic realm="Secure Area"'
+     return 404, [], ""
#+end_src

This turns the honeypot into a credential trap for automated brute-forcers and scanners.

---

**** 🧰 New Helper Functions for Header Parsing and Auth Decoding
I had to introduce two utility functions:

- parse_to_json() transforms header tuples into a JSON dictionary.
- decode_basic_auth() decodes Base64 credentials and validates them.

#+begin_src python
def parse_to_json(data):
    return json.dumps({key: value for key, value in data})

def decode_basic_auth(b64_string):
    try:
        decoded_bytes = base64.b64decode(b64_string, validate=True)
        decoded_str = decoded_bytes.decode('utf-8')
        if ':' in decoded_str:
            return decoded_str
        else:
            return "[invalid format: missing colon]"
    except Exception as e:
        return f"[decode error: {e}]"
#+end_src

These enable safe and consistent parsing for incoming HTTP headers.

---

**** 📦 Structured Request Parsing & Credential Extraction in on_complete()
I had to completely rework the on_complete() method to:

- Parse the HTTP request line
- Convert headers to a JSON object
- Extract relevant metadata and credentials
- Store all data in `req_dict`, passed to the logger

#+begin_src diff
-        extra = {}
+        req_dict = {}
...
+        lines = request.split('\n')
+        first_line = lines[0].strip()
+        parts = first_line.split()
+        requested_url = parts[1] if len(parts) > 1 else ""
+        method = parts[0] if len(parts) > 0 else ""
+        req_dict['request_body'] = requested_url
+        req_dict['method'] = method
+        req_dict['code'] = code
+
+        try:
+            req_output = parse_to_json(req_headers)
+            parsed_req = json.loads(req_output)
+        except Exception as e:
+            parsed_req = {}
+
+        for key in ['Host', 'User-Agent', 'Accept', 'Accept-Language',
+                    'Accept-Encoding', 'Authorization']:
+            req_dict[key] = parsed_req.get(key, '')
+
+        auth = parsed_req.get('Authorization', '')
+        if auth.startswith("Basic "):
+            try:
+                auth_data = auth.split(" ", 1)[1]
+                decoded_creds = encode.decode_base64(auth_data)
+                req_dict['creds'] = decoded_creds
+            except Exception as e:
+                req_dict['creds'] = f"[decode error: {e}]"
#+end_src

This prepares the logs to include useful hunting metadata for later analysis.

---

**** 🌐 Enriched Connection Metadata Logging
Additional context is logged to req_dict, including:

- Remote IP and port
- SSL usage @@comment: this can be removed as it is not needed@@
- Listening port
- HTTP response code
- Response headers

#+begin_src diff
+        remote_ip = client[0] if isinstance(client, tuple) else ''
+        remote_port = client[1] if isinstance(client, tuple) else ''
+        is_ssl = getattr(self, 'is_ssl', False)
+        port = getattr(self, 'port', '8843')
+
+        req_dict['remote_ip'] = remote_ip
+        req_dict['remote_port'] = remote_port
+        req_dict['is_ssl'] = is_ssl
+        req_dict['port'] = port
+        req_dict['response_headers'] = res_dict
+
+        self.log(client, request, response, res_dict, req_dict)
#+end_src

This provides rich forensic data for Elasticsearch or Splunk pipelines.

---

**** 🔑 Highlights

- **🆕 Auto-injection of `ElasticSearchLogger`**  
  Ensures logs are never silently dropped, even if no logger is passed explicitly.

- **🔐 Basic Auth Simulation with 401 Challenge**  
  Returns `401 Unauthorized` on suspicious paths to bait scanners.

- **🧰 Safe Parsing & Decoding with Helpers**  
  New functions parse_to_json() and decode_basic_auth() added for reliability.

- **📦 Structured Logging in on_complete()**  
  Fully rewritten to extract metadata, decode credentials, and prepare logs.

- **🌐 Rich Connection Context**  
  Logs IP, port, and full response headers for correlation.

**** 🧠 Use Case

These changes upgrade ApachePasswordServer.py from a toy honeypot to a serious
data source for threat hunting. It can now be safely deployed in research
environments, logging attack metadata in structured formats ideal for analysis
pipelines like Elasticsearch + Kibana or Splunk.

*** 📝 Conclusion
:PROPERTIES:
:CUSTOM_ID: v-dot-conclusion
:END:
